{"class_name": "Sequential", "config": {"name": "sequential_4", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "q_dense_6_input"}}, {"class_name": "QDense", "config": {"name": "q_dense_6", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "units": 10, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "QInitializer", "config": {"initializer": {"class_name": "HeNormal", "config": {"seed": null}, "__passive_serialization__": true}, "use_scale": true, "quantizer": {"class_name": "quantized_bits", "config": {"bits": 10, "integer": 4, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "__passive_serialization__": true}}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "Clip", "config": {"min_value": -16.0, "max_value": 16.0}}, "bias_constraint": {"class_name": "Clip", "config": {"min_value": -16.0, "max_value": 16.0}}, "kernel_quantizer": {"class_name": "quantized_bits", "config": {"bits": 10, "integer": 4, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}}, "bias_quantizer": {"class_name": "quantized_bits", "config": {"bits": 10, "integer": 4, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}}, "kernel_range": null, "bias_range": null}}, {"class_name": "QDense", "config": {"name": "q_dense_7", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "QInitializer", "config": {"initializer": {"class_name": "HeNormal", "config": {"seed": null}, "__passive_serialization__": true}, "use_scale": true, "quantizer": {"class_name": "quantized_bits", "config": {"bits": 10, "integer": 4, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "__passive_serialization__": true}}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "Clip", "config": {"min_value": -16.0, "max_value": 16.0}}, "bias_constraint": {"class_name": "Clip", "config": {"min_value": -16.0, "max_value": 16.0}}, "kernel_quantizer": {"class_name": "quantized_bits", "config": {"bits": 10, "integer": 4, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}}, "bias_quantizer": {"class_name": "quantized_bits", "config": {"bits": 10, "integer": 4, "symmetric": 0, "alpha": 1, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}}, "kernel_range": null, "bias_range": null}}]}, "keras_version": "2.10.0", "backend": "tensorflow"}